avr-rust/avrd/packs/atmega/ATmega3290PA.atdf
      <value-group caption="" name="COMM_STOP_BIT_SEL">
        <value caption="1-bit" name="VAL_0x00" value="0x00"/>
        <value caption="2-bit" name="VAL_0x01" value="0x01"/>
      </value-group>
    </module>
    <module caption="Liquid Crystal Display" name="LCD">
      <register-group caption="Liquid Crystal Display" name="LCD">
        <register caption="LCD Data Register 19" name="LCDDR19" offset="0xFF" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 18" name="LCDDR18" offset="0xFE" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 17" name="LCDDR17" offset="0xFD" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 16" name="LCDDR16" offset="0xFC" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 15" name="LCDDR15" offset="0xFB" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 14" name="LCDDR14" offset="0xFA" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 13" name="LCDDR13" offset="0xF9" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 12" name="LCDDR12" offset="0xF8" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 11" name="LCDDR11" offset="0xF7" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 10" name="LCDDR10" offset="0xF6" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 9" name="LCDDR9" offset="0xF5" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 8" name="LCDDR8" offset="0xF4" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 7" name="LCDDR7" offset="0xF3" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 6" name="LCDDR6" offset="0xF2" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 5" name="LCDDR5" offset="0xF1" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 4" name="LCDDR4" offset="0xF0" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 3" name="LCDDR3" offset="0xEF" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 2" name="LCDDR2" offset="0xEE" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 1" name="LCDDR1" offset="0xED" size="1" mask="0xFF"/>
        <register caption="LCD Data Register 0" name="LCDDR0" offset="0xEC" size="1" mask="0xFF"/>
        <register caption="LCD Contrast Control Register" name="LCDCCR" offset="0xE7" size="1">
          <bitfield caption="LCD Display Configurations" mask="0xE0" name="LCDDC" values="LCD_DISP_CONF_DRIVE"/>
          <bitfield caption="LCD Maximum Drive Time" mask="0x10" name="LCDMDT"/>
          <bitfield caption="LCD Contrast Controls" mask="0x0F" name="LCDCC" values="LCD_CONTRAST"/>
        </register>
        <register caption="LCD Frame Rate Register" name="LCDFRR" offset="0xE6" size="1">
          <bitfield caption="LCD Prescaler Selects" mask="0x70" name="LCDPS" values="LCD_PRESCALE"/>
          <bitfield caption="LCD Clock Dividers" mask="0x07" name="LCDCD" values="MISC_3BIT_COUNT"/>
        </register>
        <register caption="LCD Control and Status Register B" name="LCDCRB" offset="0xE5" size="1">
          <bitfield caption="LCD CLock Select" mask="0x80" name="LCDCS"/>
          <bitfield caption="LCD 1/2 Bias Select" mask="0x40" name="LCD2B"/>
          <bitfield caption="LCD Mux Selects" mask="0x30" name="LCDMUX"/>
          <bitfield caption="LCD Port Masks" mask="0x0F" name="LCDPM" values="LCD_PORT_MASK_4BIT"/>
        </register>
        <register caption="LCD Control and Status Register A" name="LCDCRA" offset="0xE4" size="1" ocd-rw="R">
          <bitfield caption="LCD Enable" mask="0x80" name="LCDEN"/>
          <bitfield caption="LCD A or B waveform" mask="0x40" name="LCDAB"/>
          <bitfield caption="LCD Interrupt Flag" mask="0x10" name="LCDIF"/>
          <bitfield caption="LCD Interrupt Enable" mask="0x08" name="LCDIE"/>
          <bitfield caption="LCD Buffer Disable" mask="0x04" name="LCDBD"/>
          <bitfield caption="LCD Contrast Control Disable" mask="0x02" name="LCDCCD"/>
          <bitfield caption="LCD Blanking" mask="0x01" name="LCDBL"/>
        </register>
      </register-group>
      <value-group caption="" name="LCD_DISP_CONF_DRIVE">
        <value caption="300us" name="VAL_0x00" value="0x00"/>
        <value caption="70us" name="VAL_0x01" value="0x01"/>
        <value caption="150us" name="VAL_0x02" value="0x02"/>
        <value caption="450us" name="VAL_0x03" value="0x03"/>
        <value caption="575us" name="VAL_0x04" value="0x04"/>
        <value caption="850us" name="VAL_0x05" value="0x05"/>
        <value caption="1150us" name="VAL_0x06" value="0x06"/>
        <value caption="50% of LCD clock" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="LCD_CONTRAST">
        <value caption="2.60V" name="VAL_0x00" value="0x00"/>
        <value caption="2.65V" name="VAL_0x01" value="0x01"/>
        <value caption="2.70V" name="VAL_0x02" value="0x02"/>
        <value caption="2.75V" name="VAL_0x03" value="0x03"/>
        <value caption="2.80V" name="VAL_0x04" value="0x04"/>
        <value caption="2.85V" name="VAL_0x05" value="0x05"/>
        <value caption="2.90V" name="VAL_0x06" value="0x06"/>
        <value caption="2.95V" name="VAL_0x07" value="0x07"/>
        <value caption="3.00V" name="VAL_0x08" value="0x08"/>
        <value caption="3.05V" name="VAL_0x09" value="0x09"/>
        <value caption="3.10V" name="VAL_0x0A" value="0x0A"/>
        <value caption="3.15V" name="VAL_0x0B" value="0x0B"/>
        <value caption="3.20V" name="VAL_0x0C" value="0x0C"/>
        <value caption="3.25V" name="VAL_0x0D" value="0x0D"/>
        <value caption="3.30V" name="VAL_0x0E" value="0x0E"/>
        <value caption="3.35V" name="VAL_0x0F" value="0x0F"/>
      </value-group>
      <value-group caption="" name="LCD_PRESCALE">
        <value caption="ClkLCD/16" name="VAL_0x00" value="0x00"/>
        <value caption="ClkLCD/64" name="VAL_0x01" value="0x01"/>
        <value caption="ClkLCD/128" name="VAL_0x02" value="0x02"/>
        <value caption="ClkLCD/256" name="VAL_0x03" value="0x03"/>
        <value caption="ClkLCD/512" name="VAL_0x04" value="0x04"/>
        <value caption="ClkLCD/1024" name="VAL_0x05" value="0x05"/>
        <value caption="ClkLCD/2048" name="VAL_0x06" value="0x06"/>
        <value caption="ClkLCD/4096" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="MISC_3BIT_COUNT">
        <value caption="1" name="VAL_0x00" value="0x00"/>
        <value caption="2" name="VAL_0x01" value="0x01"/>
        <value caption="3" name="VAL_0x02" value="0x02"/>
        <value caption="4" name="VAL_0x03" value="0x03"/>
        <value caption="5" name="VAL_0x04" value="0x04"/>
        <value caption="6" name="VAL_0x05" value="0x05"/>
        <value caption="7" name="VAL_0x06" value="0x06"/>
        <value caption="8" name="VAL_0x07" value="0x07"/>
      </value-group>
      <value-group caption="" name="LCD_PORT_MASK_4BIT">
        <value caption="SEG0:12" name="VAL_0x00" value="0x00"/>
        <value caption="SEG0:14" name="VAL_0x01" value="0x01"/>
        <value caption="SEG0:15" name="VAL_0x02" value="0x02"/>
        <value caption="SEG0:18" name="VAL_0x03" value="0x03"/>
        <value caption="SEG0:20" name="VAL_0x04" value="0x04"/>
        <value caption="SEG0:22" name="VAL_0x05" value="0x05"/>
        <value caption="SEG0:23" name="VAL_0x06" value="0x06"/>
        <value caption="SEG0:24" name="VAL_0x07" value="0x07"/>
        <value caption="SEG0:26" name="VAL_0x08" value="0x08"/>
        <value caption="SEG0:28" name="VAL_0x09" value="0x09"/>
        <value caption="SEG0:30" name="VAL_0x0A" value="0x0A"/>
        <value caption="SEG0:32" name="VAL_0x0B" value="0x0B"/>
        <value caption="SEG0:34" name="VAL_0x0C" value="0x0C"/>
        <value caption="SEG0:36" name="VAL_0x0D" value="0x0D"/>
        <value caption="SEG0:38" name="VAL_0x0E" value="0x0E"/>
        <value caption="SEG0:39" name="VAL_0x0F" value="0x0F"/>
      </value-group>
    </module>
    <module caption="CPU Registers" name="CPU">
      <register-group caption="CPU Registers" name="CPU">
        <register caption="Status Register" name="SREG" offset="0x5F" size="1">
          <bitfield caption="Global Interrupt Enable" mask="0x80" name="I"/>
          <bitfield caption="Bit Copy Storage" mask="0x40" name="T"/>
          <bitfield caption="Half Carry Flag" mask="0x20" name="H"/>
          <bitfield caption="Sign Bit" mask="0x10" name="S"/>
          <bitfield caption="Two's Complement Overflow Flag" mask="0x08" name="V"/>
          <bitfield caption="Negative Flag" mask="0x04" name="N"/>
          <bitfield caption="Zero Flag" mask="0x02" name="Z"/>
          <bitfield caption="Carry Flag" mask="0x01" name="C"/>
        </register>
